app/views/agenda_items/edit.html.erb


        <%= select_tag(:event_id, options_from_collection_for_select(Event.all, :id, :description), :class => "form-control") %>
---
SELECT "events".* FROM "events"