app/views/events/new.html.erb

SELECT "days".* FROM "days"
---
        </label>
<%= select_tag(:day_id, options_from_collection_for_select(Day.all, :id, :day_of_week), :class => "form-control") %>