app/views/days/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."day_id" = ?  [["day_id", 1]]
---

<% @day.events.each do |event| %>