app/controllers/agenda_items_controller.rb

  def index
    @agenda_items = AgendaItem.all
---
SELECT "agenda_items".* FROM "agenda_items"

  def show
    @agenda_item = AgendaItem.find(params[:id])
---
SELECT  "agenda_items".* FROM "agenda_items" WHERE "agenda_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @agenda_item = AgendaItem.new

    @agenda_item.start_time = params[:start_time]
    @agenda_item.end_time = params[:end_time]
    @agenda_item.description = params[:description]
    @agenda_item.status = params[:status]
    @agenda_item.event_id = params[:event_id]
    @agenda_item.leader = params[:leader]

    save_status = @agenda_item.save
---
INSERT INTO "agenda_items" ("start_time", "end_time", "description", "status", "event_id", "leader", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @agenda_item = AgendaItem.find(params[:id])
---
SELECT  "agenda_items".* FROM "agenda_items" WHERE "agenda_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @agenda_item = AgendaItem.find(params[:id])

    @agenda_item.start_time = params[:start_time]
    @agenda_item.end_time = params[:end_time]
    @agenda_item.description = params[:description]
    @agenda_item.status = params[:status]
    @agenda_item.event_id = params[:event_id]
    @agenda_item.leader = params[:leader]

    save_status = @agenda_item.save
---
SELECT  "agenda_items".* FROM "agenda_items" WHERE "agenda_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "agenda_items" SET "start_time" = ?, "end_time" = ?, "updated_at" = ? WHERE "agenda_items"."id" = ?  [["start_time", "2000-01-01 04:10:00"], ["end_time", "2000-01-01 05:05:00"], ["updated_at", "2017-06-11 16:07:16.130836"], ["id", 1]]

  def destroy
    @agenda_item = AgendaItem.find(params[:id])

    @agenda_item.destroy
---
SELECT  "agenda_items".* FROM "agenda_items" WHERE "agenda_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "agenda_items" WHERE "agenda_items"."id" = ?  [["id", 3]]