app/controllers/days_controller.rb

  def index
    @days = Day.all
---
SELECT "days".* FROM "days"

  def show
    @day = Day.find(params[:id])
---
SELECT  "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @day = Day.new

    @day.day_of_week = params[:day_of_week]

    save_status = @day.save
---
INSERT INTO "days" ("day_of_week", "created_at", "updated_at") VALUES (?, ?, ?)  [["day_of_week", "Friday"], ["created_at", "2017-06-10 19:59:54.332480"], ["updated_at", "2017-06-10 19:59:54.332480"]]

  def edit
    @day = Day.find(params[:id])
---
SELECT  "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]