app/controllers/events_controller.rb

INSERT INTO "events" ("start_time", "end_time", "description", "day_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new

    @event.start_time = params[:start_time]
    @event.end_time = params[:end_time]
    @event.description = params[:description]
    @event.day_id = params[:day_id]

    save_status = @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "start_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_time", "2000-01-01 01:45:00"], ["updated_at", "2017-06-11 15:57:11.531224"], ["id", 1]]
---
  def update
    @event = Event.find(params[:id])

    @event.start_time = params[:start_time]
    @event.end_time = params[:end_time]
    @event.description = params[:description]
    @event.day_id = params[:day_id]

    save_status = @event.save